"""

Розробіть систему, яка відстежуватиме час, витрачений користувачем на читання книги.
Користувач повинен мати можливість розпочати сесію читання, завершити її,
та система повинна зберігати тривалість кожної сесії та
загальний час читання для кожної книги.

1)
Використовуючи DRF створити:
-- отримати список книг з інформацією: назва, автор, рік публікації, короткий опис

-- отримати деталі книги: назва, автор, рік публікації, короткий опис, повний опис, дата останнього читання

-- починати та завершувати сесію читання, вказуючи ID книги.
До кожного user своя сесія. User не може розпочати більше однієї сесії з однією і тією ж книгою
Якщо починає сесію з іншою книгою, сесія попередньою книгою має завершитись автоматично

-- отримати загальний час читання кожної книги та загальну статичтику user

2)
Асинхронне завдання з користанням Celery:
-- Створити задачу, яка щодня збирає статистику загального читання user за остання 7 і 30 днів
і зберегти в профіль користувача
(1+2+3+4+5+6+7) = 7

3)
Написати тести, щоб перевірити кожен аспект вашого API та асинхронного завдання

За бажанням використати DOKER
"""
